import React from 'react';
import './Blogs.css';

const Blogs = () => {
    return (
        <React.Fragment>
            <h1 className='dashCenter'>Blogs</h1>
            <div className='quesMain'>
                <div className="ques-1">
                    <h1>What is Contaxt API?</h1>
                    <p>প্রসঙ্গটি এমন ডেটা ভাগ করার জন্য ডিজাইন করা হয়েছে যা প্রতিক্রিয়া উপাদানগুলির একটি গাছের জন্য "গ্লোবাল" হিসাবে বিবেচিত হতে পারে৷ প্রসঙ্গ ব্যবহার করে, আমরা মধ্যবর্তী উপাদানগুলির মাধ্যমে প্রপস পাস করা এড়াতে পারি৷ প্রসঙ্গ প্রাথমিকভাবে ব্যবহৃত হয় যখন কিছু ডেটা বিভিন্ন নেস্টিং স্তরে অনেক উপাদান দ্বারা অ্যাক্সেসযোগ্য হওয়ার প্রয়োজন হয়৷ .প্রতিটি কনটেক্সট অবজেক্ট একটি প্রোভাইডার রিঅ্যাক্ট কম্পোনেন্টের সাথে আসে যা কনটেক্সট পরিবর্তনে সাবস্ক্রাইব করার জন্য কনটেক্সট কম্পোনেন্টকে অনুমতি দেয়।</p>
                </div>
                <div className="ques-2">
                    <h1>What is sementic tag?</h1>
                    <p>শব্দার্থিক এইচটিএমএল বা শব্দার্থিক মার্কআপ হল এইচটিএমএল যা কেবল উপস্থাপনার পরিবর্তে ওয়েব পৃষ্ঠার অর্থের পরিচয় দেয়৷ শব্দার্থিক এইচটিএমএল লেখার সুবিধাটি যে কোনও ওয়েবের ড্রাইভিং লক্ষ্য কী হওয়া উচিত তা থেকে উদ্ভূত৷ যদিও প্রায় প্রতিটি HTML4 ট্যাগ এবং সমস্ত HTML5 ট্যাগের শব্দার্থিক অর্থ রয়েছে৷ , কিছু ট্যাগ প্রাথমিকভাবে শব্দার্থিক। আপনি শব্দার্থিক মার্কআপ এবং স্মার্টভাবে প্রয়োগ করা CSS ব্যবহার করে এই সমস্ত জিনিসগুলি সহজেই করতে পারেন।</p>
                </div>
            </div>
        </React.Fragment>
    );
};

export default Blogs;